reading configurations from config file: cfg/tune_resnet50_175_38_medium.cfg
model: resnet50
source model file: D:/Downloads/amazon/bottleneck/resnet50/frozen175_20170705-103801.h5
number of frozen layers: 38
[8e-05, 1e-06]
[100, 10]
batch size: 16
(40479L, 224L, 224L, 3L)
(40479L, 17L)
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 3, 224, 224)   0                                            
____________________________________________________________________________________________________
zeropadding2d_1 (ZeroPadding2D)  (None, 3, 230, 230)   0           input_1[0][0]                    
____________________________________________________________________________________________________
conv1 (Convolution2D)            (None, 64, 112, 112)  9472        zeropadding2d_1[0][0]            
____________________________________________________________________________________________________
bn_conv1 (BatchNormalization)    (None, 64, 112, 112)  256         conv1[0][0]                      
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 64, 112, 112)  0           bn_conv1[0][0]                   
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)    (None, 64, 55, 55)    0           activation_1[0][0]               
____________________________________________________________________________________________________
res2a_branch2a (Convolution2D)   (None, 64, 55, 55)    4160        maxpooling2d_1[0][0]             
____________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizatio (None, 64, 55, 55)    256         res2a_branch2a[0][0]             
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 64, 55, 55)    0           bn2a_branch2a[0][0]              
____________________________________________________________________________________________________
res2a_branch2b (Convolution2D)   (None, 64, 55, 55)    36928       activation_2[0][0]               
____________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizatio (None, 64, 55, 55)    256         res2a_branch2b[0][0]             
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 64, 55, 55)    0           bn2a_branch2b[0][0]              
____________________________________________________________________________________________________
res2a_branch2c (Convolution2D)   (None, 256, 55, 55)   16640       activation_3[0][0]               
____________________________________________________________________________________________________
res2a_branch1 (Convolution2D)    (None, 256, 55, 55)   16640       maxpooling2d_1[0][0]             
____________________________________________________________________________________________________
bn2a_branch2c (BatchNormalizatio (None, 256, 55, 55)   1024        res2a_branch2c[0][0]             
____________________________________________________________________________________________________
bn2a_branch1 (BatchNormalization (None, 256, 55, 55)   1024        res2a_branch1[0][0]              
____________________________________________________________________________________________________
merge_1 (Merge)                  (None, 256, 55, 55)   0           bn2a_branch2c[0][0]              
                                                                   bn2a_branch1[0][0]               
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 256, 55, 55)   0           merge_1[0][0]                    
____________________________________________________________________________________________________
res2b_branch2a (Convolution2D)   (None, 64, 55, 55)    16448       activation_4[0][0]               
____________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizatio (None, 64, 55, 55)    256         res2b_branch2a[0][0]             
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 64, 55, 55)    0           bn2b_branch2a[0][0]              
____________________________________________________________________________________________________
res2b_branch2b (Convolution2D)   (None, 64, 55, 55)    36928       activation_5[0][0]               
____________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizatio (None, 64, 55, 55)    256         res2b_branch2b[0][0]             
____________________________________________________________________________________________________
activation_6 (Activation)        (None, 64, 55, 55)    0           bn2b_branch2b[0][0]              
____________________________________________________________________________________________________
res2b_branch2c (Convolution2D)   (None, 256, 55, 55)   16640       activation_6[0][0]               
____________________________________________________________________________________________________
bn2b_branch2c (BatchNormalizatio (None, 256, 55, 55)   1024        res2b_branch2c[0][0]             
____________________________________________________________________________________________________
merge_2 (Merge)                  (None, 256, 55, 55)   0           bn2b_branch2c[0][0]              
                                                                   activation_4[0][0]               
____________________________________________________________________________________________________
activation_7 (Activation)        (None, 256, 55, 55)   0           merge_2[0][0]                    
____________________________________________________________________________________________________
res2c_branch2a (Convolution2D)   (None, 64, 55, 55)    16448       activation_7[0][0]               
____________________________________________________________________________________________________
bn2c_branch2a (BatchNormalizatio (None, 64, 55, 55)    256         res2c_branch2a[0][0]             
____________________________________________________________________________________________________
activation_8 (Activation)        (None, 64, 55, 55)    0           bn2c_branch2a[0][0]              
____________________________________________________________________________________________________
res2c_branch2b (Convolution2D)   (None, 64, 55, 55)    36928       activation_8[0][0]               
____________________________________________________________________________________________________
bn2c_branch2b (BatchNormalizatio (None, 64, 55, 55)    256         res2c_branch2b[0][0]             
____________________________________________________________________________________________________
activation_9 (Activation)        (None, 64, 55, 55)    0           bn2c_branch2b[0][0]              
____________________________________________________________________________________________________
res2c_branch2c (Convolution2D)   (None, 256, 55, 55)   16640       activation_9[0][0]               
____________________________________________________________________________________________________
bn2c_branch2c (BatchNormalizatio (None, 256, 55, 55)   1024        res2c_branch2c[0][0]             
____________________________________________________________________________________________________
merge_3 (Merge)                  (None, 256, 55, 55)   0           bn2c_branch2c[0][0]              
                                                                   activation_7[0][0]               
____________________________________________________________________________________________________
activation_10 (Activation)       (None, 256, 55, 55)   0           merge_3[0][0]                    
____________________________________________________________________________________________________
res3a_branch2a (Convolution2D)   (None, 128, 28, 28)   32896       activation_10[0][0]              
____________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizatio (None, 128, 28, 28)   512         res3a_branch2a[0][0]             
____________________________________________________________________________________________________
activation_11 (Activation)       (None, 128, 28, 28)   0           bn3a_branch2a[0][0]              
____________________________________________________________________________________________________
res3a_branch2b (Convolution2D)   (None, 128, 28, 28)   147584      activation_11[0][0]              
____________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizatio (None, 128, 28, 28)   512         res3a_branch2b[0][0]             
____________________________________________________________________________________________________
activation_12 (Activation)       (None, 128, 28, 28)   0           bn3a_branch2b[0][0]              
____________________________________________________________________________________________________
res3a_branch2c (Convolution2D)   (None, 512, 28, 28)   66048       activation_12[0][0]              
____________________________________________________________________________________________________
res3a_branch1 (Convolution2D)    (None, 512, 28, 28)   131584      activation_10[0][0]              
____________________________________________________________________________________________________
bn3a_branch2c (BatchNormalizatio (None, 512, 28, 28)   2048        res3a_branch2c[0][0]             
____________________________________________________________________________________________________
bn3a_branch1 (BatchNormalization (None, 512, 28, 28)   2048        res3a_branch1[0][0]              
____________________________________________________________________________________________________
merge_4 (Merge)                  (None, 512, 28, 28)   0           bn3a_branch2c[0][0]              
                                                                   bn3a_branch1[0][0]               
____________________________________________________________________________________________________
activation_13 (Activation)       (None, 512, 28, 28)   0           merge_4[0][0]                    
____________________________________________________________________________________________________
res3b_branch2a (Convolution2D)   (None, 128, 28, 28)   65664       activation_13[0][0]              
____________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizatio (None, 128, 28, 28)   512         res3b_branch2a[0][0]             
____________________________________________________________________________________________________
activation_14 (Activation)       (None, 128, 28, 28)   0           bn3b_branch2a[0][0]              
____________________________________________________________________________________________________
res3b_branch2b (Convolution2D)   (None, 128, 28, 28)   147584      activation_14[0][0]              
____________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizatio (None, 128, 28, 28)   512         res3b_branch2b[0][0]             
____________________________________________________________________________________________________
activation_15 (Activation)       (None, 128, 28, 28)   0           bn3b_branch2b[0][0]              
____________________________________________________________________________________________________
res3b_branch2c (Convolution2D)   (None, 512, 28, 28)   66048       activation_15[0][0]              
____________________________________________________________________________________________________
bn3b_branch2c (BatchNormalizatio (None, 512, 28, 28)   2048        res3b_branch2c[0][0]             
____________________________________________________________________________________________________
merge_5 (Merge)                  (None, 512, 28, 28)   0           bn3b_branch2c[0][0]              
                                                                   activation_13[0][0]              
____________________________________________________________________________________________________
activation_16 (Activation)       (None, 512, 28, 28)   0           merge_5[0][0]                    
____________________________________________________________________________________________________
res3c_branch2a (Convolution2D)   (None, 128, 28, 28)   65664       activation_16[0][0]              
____________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizatio (None, 128, 28, 28)   512         res3c_branch2a[0][0]             
____________________________________________________________________________________________________
activation_17 (Activation)       (None, 128, 28, 28)   0           bn3c_branch2a[0][0]              
____________________________________________________________________________________________________
res3c_branch2b (Convolution2D)   (None, 128, 28, 28)   147584      activation_17[0][0]              
____________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizatio (None, 128, 28, 28)   512         res3c_branch2b[0][0]             
____________________________________________________________________________________________________
activation_18 (Activation)       (None, 128, 28, 28)   0           bn3c_branch2b[0][0]              
____________________________________________________________________________________________________
res3c_branch2c (Convolution2D)   (None, 512, 28, 28)   66048       activation_18[0][0]              
____________________________________________________________________________________________________
bn3c_branch2c (BatchNormalizatio (None, 512, 28, 28)   2048        res3c_branch2c[0][0]             
____________________________________________________________________________________________________
merge_6 (Merge)                  (None, 512, 28, 28)   0           bn3c_branch2c[0][0]              
                                                                   activation_16[0][0]              
____________________________________________________________________________________________________
activation_19 (Activation)       (None, 512, 28, 28)   0           merge_6[0][0]                    
____________________________________________________________________________________________________
res3d_branch2a (Convolution2D)   (None, 128, 28, 28)   65664       activation_19[0][0]              
____________________________________________________________________________________________________
bn3d_branch2a (BatchNormalizatio (None, 128, 28, 28)   512         res3d_branch2a[0][0]             
____________________________________________________________________________________________________
activation_20 (Activation)       (None, 128, 28, 28)   0           bn3d_branch2a[0][0]              
____________________________________________________________________________________________________
res3d_branch2b (Convolution2D)   (None, 128, 28, 28)   147584      activation_20[0][0]              
____________________________________________________________________________________________________
bn3d_branch2b (BatchNormalizatio (None, 128, 28, 28)   512         res3d_branch2b[0][0]             
____________________________________________________________________________________________________
activation_21 (Activation)       (None, 128, 28, 28)   0           bn3d_branch2b[0][0]              
____________________________________________________________________________________________________
res3d_branch2c (Convolution2D)   (None, 512, 28, 28)   66048       activation_21[0][0]              
____________________________________________________________________________________________________
bn3d_branch2c (BatchNormalizatio (None, 512, 28, 28)   2048        res3d_branch2c[0][0]             
____________________________________________________________________________________________________
merge_7 (Merge)                  (None, 512, 28, 28)   0           bn3d_branch2c[0][0]              
                                                                   activation_19[0][0]              
____________________________________________________________________________________________________
activation_22 (Activation)       (None, 512, 28, 28)   0           merge_7[0][0]                    
____________________________________________________________________________________________________
res4a_branch2a (Convolution2D)   (None, 256, 14, 14)   131328      activation_22[0][0]              
____________________________________________________________________________________________________
bn4a_branch2a (BatchNormalizatio (None, 256, 14, 14)   1024        res4a_branch2a[0][0]             
____________________________________________________________________________________________________
activation_23 (Activation)       (None, 256, 14, 14)   0           bn4a_branch2a[0][0]              
____________________________________________________________________________________________________
res4a_branch2b (Convolution2D)   (None, 256, 14, 14)   590080      activation_23[0][0]              
____________________________________________________________________________________________________
bn4a_branch2b (BatchNormalizatio (None, 256, 14, 14)   1024        res4a_branch2b[0][0]             
____________________________________________________________________________________________________
activation_24 (Activation)       (None, 256, 14, 14)   0           bn4a_branch2b[0][0]              
____________________________________________________________________________________________________
res4a_branch2c (Convolution2D)   (None, 1024, 14, 14)  263168      activation_24[0][0]              
____________________________________________________________________________________________________
res4a_branch1 (Convolution2D)    (None, 1024, 14, 14)  525312      activation_22[0][0]              
____________________________________________________________________________________________________
bn4a_branch2c (BatchNormalizatio (None, 1024, 14, 14)  4096        res4a_branch2c[0][0]             
____________________________________________________________________________________________________
bn4a_branch1 (BatchNormalization (None, 1024, 14, 14)  4096        res4a_branch1[0][0]              
____________________________________________________________________________________________________
merge_8 (Merge)                  (None, 1024, 14, 14)  0           bn4a_branch2c[0][0]              
                                                                   bn4a_branch1[0][0]               
____________________________________________________________________________________________________
activation_25 (Activation)       (None, 1024, 14, 14)  0           merge_8[0][0]                    
____________________________________________________________________________________________________
res4b_branch2a (Convolution2D)   (None, 256, 14, 14)   262400      activation_25[0][0]              
____________________________________________________________________________________________________
bn4b_branch2a (BatchNormalizatio (None, 256, 14, 14)   1024        res4b_branch2a[0][0]             
____________________________________________________________________________________________________
activation_26 (Activation)       (None, 256, 14, 14)   0           bn4b_branch2a[0][0]              
____________________________________________________________________________________________________
res4b_branch2b (Convolution2D)   (None, 256, 14, 14)   590080      activation_26[0][0]              
____________________________________________________________________________________________________
bn4b_branch2b (BatchNormalizatio (None, 256, 14, 14)   1024        res4b_branch2b[0][0]             
____________________________________________________________________________________________________
activation_27 (Activation)       (None, 256, 14, 14)   0           bn4b_branch2b[0][0]              
____________________________________________________________________________________________________
res4b_branch2c (Convolution2D)   (None, 1024, 14, 14)  263168      activation_27[0][0]              
____________________________________________________________________________________________________
bn4b_branch2c (BatchNormalizatio (None, 1024, 14, 14)  4096        res4b_branch2c[0][0]             
____________________________________________________________________________________________________
merge_9 (Merge)                  (None, 1024, 14, 14)  0           bn4b_branch2c[0][0]              
                                                                   activation_25[0][0]              
____________________________________________________________________________________________________
activation_28 (Activation)       (None, 1024, 14, 14)  0           merge_9[0][0]                    
____________________________________________________________________________________________________
res4c_branch2a (Convolution2D)   (None, 256, 14, 14)   262400      activation_28[0][0]              
____________________________________________________________________________________________________
bn4c_branch2a (BatchNormalizatio (None, 256, 14, 14)   1024        res4c_branch2a[0][0]             
____________________________________________________________________________________________________
activation_29 (Activation)       (None, 256, 14, 14)   0           bn4c_branch2a[0][0]              
____________________________________________________________________________________________________
res4c_branch2b (Convolution2D)   (None, 256, 14, 14)   590080      activation_29[0][0]              
____________________________________________________________________________________________________
bn4c_branch2b (BatchNormalizatio (None, 256, 14, 14)   1024        res4c_branch2b[0][0]             
____________________________________________________________________________________________________
activation_30 (Activation)       (None, 256, 14, 14)   0           bn4c_branch2b[0][0]              
____________________________________________________________________________________________________
res4c_branch2c (Convolution2D)   (None, 1024, 14, 14)  263168      activation_30[0][0]              
____________________________________________________________________________________________________
bn4c_branch2c (BatchNormalizatio (None, 1024, 14, 14)  4096        res4c_branch2c[0][0]             
____________________________________________________________________________________________________
merge_10 (Merge)                 (None, 1024, 14, 14)  0           bn4c_branch2c[0][0]              
                                                                   activation_28[0][0]              
____________________________________________________________________________________________________
activation_31 (Activation)       (None, 1024, 14, 14)  0           merge_10[0][0]                   
____________________________________________________________________________________________________
res4d_branch2a (Convolution2D)   (None, 256, 14, 14)   262400      activation_31[0][0]              
____________________________________________________________________________________________________
bn4d_branch2a (BatchNormalizatio (None, 256, 14, 14)   1024        res4d_branch2a[0][0]             
____________________________________________________________________________________________________
activation_32 (Activation)       (None, 256, 14, 14)   0           bn4d_branch2a[0][0]              
____________________________________________________________________________________________________
res4d_branch2b (Convolution2D)   (None, 256, 14, 14)   590080      activation_32[0][0]              
____________________________________________________________________________________________________
bn4d_branch2b (BatchNormalizatio (None, 256, 14, 14)   1024        res4d_branch2b[0][0]             
____________________________________________________________________________________________________
activation_33 (Activation)       (None, 256, 14, 14)   0           bn4d_branch2b[0][0]              
____________________________________________________________________________________________________
res4d_branch2c (Convolution2D)   (None, 1024, 14, 14)  263168      activation_33[0][0]              
____________________________________________________________________________________________________
bn4d_branch2c (BatchNormalizatio (None, 1024, 14, 14)  4096        res4d_branch2c[0][0]             
____________________________________________________________________________________________________
merge_11 (Merge)                 (None, 1024, 14, 14)  0           bn4d_branch2c[0][0]              
                                                                   activation_31[0][0]              
____________________________________________________________________________________________________
activation_34 (Activation)       (None, 1024, 14, 14)  0           merge_11[0][0]                   
____________________________________________________________________________________________________
res4e_branch2a (Convolution2D)   (None, 256, 14, 14)   262400      activation_34[0][0]              
____________________________________________________________________________________________________
bn4e_branch2a (BatchNormalizatio (None, 256, 14, 14)   1024        res4e_branch2a[0][0]             
____________________________________________________________________________________________________
activation_35 (Activation)       (None, 256, 14, 14)   0           bn4e_branch2a[0][0]              
____________________________________________________________________________________________________
res4e_branch2b (Convolution2D)   (None, 256, 14, 14)   590080      activation_35[0][0]              
____________________________________________________________________________________________________
bn4e_branch2b (BatchNormalizatio (None, 256, 14, 14)   1024        res4e_branch2b[0][0]             
____________________________________________________________________________________________________
activation_36 (Activation)       (None, 256, 14, 14)   0           bn4e_branch2b[0][0]              
____________________________________________________________________________________________________
res4e_branch2c (Convolution2D)   (None, 1024, 14, 14)  263168      activation_36[0][0]              
____________________________________________________________________________________________________
bn4e_branch2c (BatchNormalizatio (None, 1024, 14, 14)  4096        res4e_branch2c[0][0]             
____________________________________________________________________________________________________
merge_12 (Merge)                 (None, 1024, 14, 14)  0           bn4e_branch2c[0][0]              
                                                                   activation_34[0][0]              
____________________________________________________________________________________________________
activation_37 (Activation)       (None, 1024, 14, 14)  0           merge_12[0][0]                   
____________________________________________________________________________________________________
res4f_branch2a (Convolution2D)   (None, 256, 14, 14)   262400      activation_37[0][0]              
____________________________________________________________________________________________________
bn4f_branch2a (BatchNormalizatio (None, 256, 14, 14)   1024        res4f_branch2a[0][0]             
____________________________________________________________________________________________________
activation_38 (Activation)       (None, 256, 14, 14)   0           bn4f_branch2a[0][0]              
____________________________________________________________________________________________________
res4f_branch2b (Convolution2D)   (None, 256, 14, 14)   590080      activation_38[0][0]              
____________________________________________________________________________________________________
bn4f_branch2b (BatchNormalizatio (None, 256, 14, 14)   1024        res4f_branch2b[0][0]             
____________________________________________________________________________________________________
activation_39 (Activation)       (None, 256, 14, 14)   0           bn4f_branch2b[0][0]              
____________________________________________________________________________________________________
res4f_branch2c (Convolution2D)   (None, 1024, 14, 14)  263168      activation_39[0][0]              
____________________________________________________________________________________________________
bn4f_branch2c (BatchNormalizatio (None, 1024, 14, 14)  4096        res4f_branch2c[0][0]             
____________________________________________________________________________________________________
merge_13 (Merge)                 (None, 1024, 14, 14)  0           bn4f_branch2c[0][0]              
                                                                   activation_37[0][0]              
____________________________________________________________________________________________________
activation_40 (Activation)       (None, 1024, 14, 14)  0           merge_13[0][0]                   
____________________________________________________________________________________________________
res5a_branch2a (Convolution2D)   (None, 512, 7, 7)     524800      activation_40[0][0]              
____________________________________________________________________________________________________
bn5a_branch2a (BatchNormalizatio (None, 512, 7, 7)     2048        res5a_branch2a[0][0]             
____________________________________________________________________________________________________
activation_41 (Activation)       (None, 512, 7, 7)     0           bn5a_branch2a[0][0]              
____________________________________________________________________________________________________
res5a_branch2b (Convolution2D)   (None, 512, 7, 7)     2359808     activation_41[0][0]              
____________________________________________________________________________________________________
bn5a_branch2b (BatchNormalizatio (None, 512, 7, 7)     2048        res5a_branch2b[0][0]             
____________________________________________________________________________________________________
activation_42 (Activation)       (None, 512, 7, 7)     0           bn5a_branch2b[0][0]              
____________________________________________________________________________________________________
res5a_branch2c (Convolution2D)   (None, 2048, 7, 7)    1050624     activation_42[0][0]              
____________________________________________________________________________________________________
res5a_branch1 (Convolution2D)    (None, 2048, 7, 7)    2099200     activation_40[0][0]              
____________________________________________________________________________________________________
bn5a_branch2c (BatchNormalizatio (None, 2048, 7, 7)    8192        res5a_branch2c[0][0]             
____________________________________________________________________________________________________
bn5a_branch1 (BatchNormalization (None, 2048, 7, 7)    8192        res5a_branch1[0][0]              
____________________________________________________________________________________________________
merge_14 (Merge)                 (None, 2048, 7, 7)    0           bn5a_branch2c[0][0]              
                                                                   bn5a_branch1[0][0]               
____________________________________________________________________________________________________
activation_43 (Activation)       (None, 2048, 7, 7)    0           merge_14[0][0]                   
____________________________________________________________________________________________________
res5b_branch2a (Convolution2D)   (None, 512, 7, 7)     1049088     activation_43[0][0]              
____________________________________________________________________________________________________
bn5b_branch2a (BatchNormalizatio (None, 512, 7, 7)     2048        res5b_branch2a[0][0]             
____________________________________________________________________________________________________
activation_44 (Activation)       (None, 512, 7, 7)     0           bn5b_branch2a[0][0]              
____________________________________________________________________________________________________
res5b_branch2b (Convolution2D)   (None, 512, 7, 7)     2359808     activation_44[0][0]              
____________________________________________________________________________________________________
bn5b_branch2b (BatchNormalizatio (None, 512, 7, 7)     2048        res5b_branch2b[0][0]             
____________________________________________________________________________________________________
activation_45 (Activation)       (None, 512, 7, 7)     0           bn5b_branch2b[0][0]              
____________________________________________________________________________________________________
res5b_branch2c (Convolution2D)   (None, 2048, 7, 7)    1050624     activation_45[0][0]              
____________________________________________________________________________________________________
bn5b_branch2c (BatchNormalizatio (None, 2048, 7, 7)    8192        res5b_branch2c[0][0]             
____________________________________________________________________________________________________
merge_15 (Merge)                 (None, 2048, 7, 7)    0           bn5b_branch2c[0][0]              
                                                                   activation_43[0][0]              
____________________________________________________________________________________________________
activation_46 (Activation)       (None, 2048, 7, 7)    0           merge_15[0][0]                   
____________________________________________________________________________________________________
res5c_branch2a (Convolution2D)   (None, 512, 7, 7)     1049088     activation_46[0][0]              
____________________________________________________________________________________________________
bn5c_branch2a (BatchNormalizatio (None, 512, 7, 7)     2048        res5c_branch2a[0][0]             
____________________________________________________________________________________________________
activation_47 (Activation)       (None, 512, 7, 7)     0           bn5c_branch2a[0][0]              
____________________________________________________________________________________________________
res5c_branch2b (Convolution2D)   (None, 512, 7, 7)     2359808     activation_47[0][0]              
____________________________________________________________________________________________________
bn5c_branch2b (BatchNormalizatio (None, 512, 7, 7)     2048        res5c_branch2b[0][0]             
____________________________________________________________________________________________________
activation_48 (Activation)       (None, 512, 7, 7)     0           bn5c_branch2b[0][0]              
____________________________________________________________________________________________________
res5c_branch2c (Convolution2D)   (None, 2048, 7, 7)    1050624     activation_48[0][0]              
____________________________________________________________________________________________________
bn5c_branch2c (BatchNormalizatio (None, 2048, 7, 7)    8192        res5c_branch2c[0][0]             
____________________________________________________________________________________________________
merge_16 (Merge)                 (None, 2048, 7, 7)    0           bn5c_branch2c[0][0]              
                                                                   activation_46[0][0]              
____________________________________________________________________________________________________
activation_49 (Activation)       (None, 2048, 7, 7)    0           merge_16[0][0]                   
____________________________________________________________________________________________________
avg_pool (AveragePooling2D)      (None, 2048, 1, 1)    0           activation_49[0][0]              
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 2048)          0           avg_pool[0][0]                   
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 512)           1049088     flatten_1[0][0]                  
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 512)           0           dense_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 17)            8721        dropout_1[0][0]                  
====================================================================================================
Total params: 24,645,521
Trainable params: 24,365,585
Non-trainable params: 279,936
____________________________________________________________________________________________________
None
(0, u'input_1', False)
(1, u'zeropadding2d_1', False)
(2, u'conv1', False)
(3, u'bn_conv1', False)
(4, u'activation_1', False)
(5, u'maxpooling2d_1', False)
(6, u'res2a_branch2a', False)
(7, u'bn2a_branch2a', False)
(8, u'activation_2', False)
(9, u'res2a_branch2b', False)
(10, u'bn2a_branch2b', False)
(11, u'activation_3', False)
(12, u'res2a_branch2c', False)
(13, u'res2a_branch1', False)
(14, u'bn2a_branch2c', False)
(15, u'bn2a_branch1', False)
(16, u'merge_1', False)
(17, u'activation_4', False)
(18, u'res2b_branch2a', False)
(19, u'bn2b_branch2a', False)
(20, u'activation_5', False)
(21, u'res2b_branch2b', False)
(22, u'bn2b_branch2b', False)
(23, u'activation_6', False)
(24, u'res2b_branch2c', False)
(25, u'bn2b_branch2c', False)
(26, u'merge_2', False)
(27, u'activation_7', False)
(28, u'res2c_branch2a', False)
(29, u'bn2c_branch2a', False)
(30, u'activation_8', False)
(31, u'res2c_branch2b', False)
(32, u'bn2c_branch2b', False)
(33, u'activation_9', False)
(34, u'res2c_branch2c', False)
(35, u'bn2c_branch2c', False)
(36, u'merge_3', False)
(37, u'activation_10', False)
(38, u'res3a_branch2a', True)
(39, u'bn3a_branch2a', True)
(40, u'activation_11', True)
(41, u'res3a_branch2b', True)
(42, u'bn3a_branch2b', True)
(43, u'activation_12', True)
(44, u'res3a_branch2c', True)
(45, u'res3a_branch1', True)
(46, u'bn3a_branch2c', True)
(47, u'bn3a_branch1', True)
(48, u'merge_4', False)
(49, u'activation_13', True)
(50, u'res3b_branch2a', True)
(51, u'bn3b_branch2a', True)
(52, u'activation_14', True)
(53, u'res3b_branch2b', True)
(54, u'bn3b_branch2b', True)
(55, u'activation_15', True)
(56, u'res3b_branch2c', True)
(57, u'bn3b_branch2c', True)
(58, u'merge_5', False)
(59, u'activation_16', True)
(60, u'res3c_branch2a', True)
(61, u'bn3c_branch2a', True)
(62, u'activation_17', True)
(63, u'res3c_branch2b', True)
(64, u'bn3c_branch2b', True)
(65, u'activation_18', True)
(66, u'res3c_branch2c', True)
(67, u'bn3c_branch2c', True)
(68, u'merge_6', False)
(69, u'activation_19', True)
(70, u'res3d_branch2a', True)
(71, u'bn3d_branch2a', True)
(72, u'activation_20', True)
(73, u'res3d_branch2b', True)
(74, u'bn3d_branch2b', True)
(75, u'activation_21', True)
(76, u'res3d_branch2c', True)
(77, u'bn3d_branch2c', True)
(78, u'merge_7', False)
(79, u'activation_22', True)
(80, u'res4a_branch2a', True)
(81, u'bn4a_branch2a', True)
(82, u'activation_23', True)
(83, u'res4a_branch2b', True)
(84, u'bn4a_branch2b', True)
(85, u'activation_24', True)
(86, u'res4a_branch2c', True)
(87, u'res4a_branch1', True)
(88, u'bn4a_branch2c', True)
(89, u'bn4a_branch1', True)
(90, u'merge_8', False)
(91, u'activation_25', True)
(92, u'res4b_branch2a', True)
(93, u'bn4b_branch2a', True)
(94, u'activation_26', True)
(95, u'res4b_branch2b', True)
(96, u'bn4b_branch2b', True)
(97, u'activation_27', True)
(98, u'res4b_branch2c', True)
(99, u'bn4b_branch2c', True)
(100, u'merge_9', False)
(101, u'activation_28', True)
(102, u'res4c_branch2a', True)
(103, u'bn4c_branch2a', True)
(104, u'activation_29', True)
(105, u'res4c_branch2b', True)
(106, u'bn4c_branch2b', True)
(107, u'activation_30', True)
(108, u'res4c_branch2c', True)
(109, u'bn4c_branch2c', True)
(110, u'merge_10', False)
(111, u'activation_31', True)
(112, u'res4d_branch2a', True)
(113, u'bn4d_branch2a', True)
(114, u'activation_32', True)
(115, u'res4d_branch2b', True)
(116, u'bn4d_branch2b', True)
(117, u'activation_33', True)
(118, u'res4d_branch2c', True)
(119, u'bn4d_branch2c', True)
(120, u'merge_11', False)
(121, u'activation_34', True)
(122, u'res4e_branch2a', True)
(123, u'bn4e_branch2a', True)
(124, u'activation_35', True)
(125, u'res4e_branch2b', True)
(126, u'bn4e_branch2b', True)
(127, u'activation_36', True)
(128, u'res4e_branch2c', True)
(129, u'bn4e_branch2c', True)
(130, u'merge_12', False)
(131, u'activation_37', True)
(132, u'res4f_branch2a', True)
(133, u'bn4f_branch2a', True)
(134, u'activation_38', True)
(135, u'res4f_branch2b', True)
(136, u'bn4f_branch2b', True)
(137, u'activation_39', True)
(138, u'res4f_branch2c', True)
(139, u'bn4f_branch2c', True)
(140, u'merge_13', False)
(141, u'activation_40', True)
(142, u'res5a_branch2a', True)
(143, u'bn5a_branch2a', True)
(144, u'activation_41', True)
(145, u'res5a_branch2b', True)
(146, u'bn5a_branch2b', True)
(147, u'activation_42', True)
(148, u'res5a_branch2c', True)
(149, u'res5a_branch1', True)
(150, u'bn5a_branch2c', True)
(151, u'bn5a_branch1', True)
(152, u'merge_14', False)
(153, u'activation_43', True)
(154, u'res5b_branch2a', True)
(155, u'bn5b_branch2a', True)
(156, u'activation_44', True)
(157, u'res5b_branch2b', True)
(158, u'bn5b_branch2b', True)
(159, u'activation_45', True)
(160, u'res5b_branch2c', True)
(161, u'bn5b_branch2c', True)
(162, u'merge_15', False)
(163, u'activation_46', True)
(164, u'res5c_branch2a', True)
(165, u'bn5c_branch2a', True)
(166, u'activation_47', True)
(167, u'res5c_branch2b', True)
(168, u'bn5c_branch2b', True)
(169, u'activation_48', True)
(170, u'res5c_branch2c', True)
(171, u'bn5c_branch2c', True)
(172, u'merge_16', False)
(173, u'activation_49', True)
(174, u'avg_pool', True)
(175, u'flatten_1', True)
(176, u'dense_1', True)
(177, u'dropout_1', True)
(178, u'dense_2', True)
learning rate :8e-05
Epoch 00000: val_loss improved from inf to 0.09175, saving model to D:/Downloads/amazon/bottleneck/resnet50/frozen38_20170717-092206.h5
Epoch 00000: val_loss improved from inf to 0.09175, saving model to D:/Downloads/amazon/bottleneck/resnet50/frozen38_20170717-092206_weights_only.h5
Epoch 00001: val_loss did not improve
Epoch 00001: val_loss did not improve
Epoch 00002: val_loss did not improve
Epoch 00002: val_loss did not improve
learning rate :1e-06
Epoch 00000: val_loss improved from 0.09175 to 0.08703, saving model to D:/Downloads/amazon/bottleneck/resnet50/frozen38_20170717-092206.h5
Epoch 00000: val_loss improved from 0.09175 to 0.08703, saving model to D:/Downloads/amazon/bottleneck/resnet50/frozen38_20170717-092206_weights_only.h5
Epoch 00001: val_loss improved from 0.08703 to 0.08666, saving model to D:/Downloads/amazon/bottleneck/resnet50/frozen38_20170717-092206.h5
Epoch 00001: val_loss improved from 0.08703 to 0.08666, saving model to D:/Downloads/amazon/bottleneck/resnet50/frozen38_20170717-092206_weights_only.h5
Epoch 00002: val_loss did not improve
Epoch 00002: val_loss did not improve
Epoch 00003: val_loss improved from 0.08666 to 0.08661, saving model to D:/Downloads/amazon/bottleneck/resnet50/frozen38_20170717-092206.h5
Epoch 00003: val_loss improved from 0.08666 to 0.08661, saving model to D:/Downloads/amazon/bottleneck/resnet50/frozen38_20170717-092206_weights_only.h5
Epoch 00004: val_loss improved from 0.08661 to 0.08655, saving model to D:/Downloads/amazon/bottleneck/resnet50/frozen38_20170717-092206.h5
Epoch 00004: val_loss improved from 0.08661 to 0.08655, saving model to D:/Downloads/amazon/bottleneck/resnet50/frozen38_20170717-092206_weights_only.h5
Epoch 00005: val_loss did not improve
Epoch 00005: val_loss did not improve
Epoch 00006: val_loss did not improve
Epoch 00006: val_loss did not improve
resnet50 model training complete. Time taken: 1:56:02.763000
loading model file: D:/Downloads/amazon/bottleneck/resnet50/frozen38_20170717-092206.h5
label:0 threshold:0.29 score:0.901941455181
label:1 threshold:0.08 score:0.90539498334
label:2 threshold:0.31 score:0.905609688139
label:3 threshold:0.17 score:0.907871945561
label:4 threshold:0.04 score:0.911936839873
label:5 threshold:0.25 score:0.911977083764
label:6 threshold:0.14 score:0.914077703266
label:7 threshold:0.17 score:0.916296101521
label:8 threshold:0.21 score:0.919021713075
label:9 threshold:0.11 score:0.920021282337
label:10 threshold:0.14 score:0.92023644765
label:11 threshold:0.17 score:0.922349162987
label:12 threshold:0.15 score:0.923297033475
label:13 threshold:0.21 score:0.92330687569
label:14 threshold:0.2 score:0.927807214006
label:15 threshold:0.18 score:0.930156605232
label:16 threshold:0.12 score:0.930250803913
('>>>> Overall precision score over validation set ', 0.87324594940084077)
('>>>> Overall recall score over validation set ', 0.95798483672124968)
('>>>> Overall F2 score over validation set ', 0.93025080391310422)
                label  optimized_threshold
0          slash_burn                 0.29
1               clear                 0.08
2            blooming                 0.31
3             primary                 0.17
4              cloudy                 0.04
5   conventional_mine                 0.25
6               water                 0.14
7                haze                 0.17
8         cultivation                 0.21
9       partly_cloudy                 0.11
10     artisinal_mine                 0.14
11         habitation                 0.17
12        bare_ground                 0.15
13          blow_down                 0.21
14        agriculture                 0.20
15               road                 0.18
16  selective_logging                 0.12
                label    f2  recall  precision  true_sum  predict_sum
0          slash_burn  0.10    0.08       0.29        24            7
1               clear  0.98    0.99       0.92      2873         3085
2            blooming  0.25    0.22       0.50        27           12
3             primary  0.99    1.00       0.97      3759         3871
4              cloudy  0.86    0.98       0.57       199          341
5   conventional_mine  0.56    0.57       0.50         7            8
6               water  0.84    0.90       0.68       716          946
7                haze  0.78    0.85       0.59       262          375
8         cultivation  0.68    0.75       0.51       451          657
9       partly_cloudy  0.94    0.96       0.84       714          816
10     artisinal_mine  0.87    0.89       0.79        35           39
11         habitation  0.78    0.82       0.68       346          416
12        bare_ground  0.46    0.47       0.41       102          117
13          blow_down  0.42    0.38       0.63        13            8
14        agriculture  0.90    0.93       0.78      1251         1490
15               road  0.86    0.89       0.77       789          916
16  selective_logging  0.38    0.43       0.26        28           47
submission file generated: D:/Downloads/amazon/my_submissions/submission_resnet50_20170717-092206.csv
